maker-community/esp-signalr/src/adapters/esp32_websocket_client.cpp
#include "esp32_websocket_client.h"
#include "signalr_client_config.h"
#include "memory_utils.h"
#include "esp_log.h"
#include <cstring>
#include <exception>
#include <memory>
#include <stdexcept>

static const char* TAG = "ESP32_WS_CLIENT";

// Pre-created exception objects to avoid throw-catch overhead in send()
// These are created once at startup and reused throughout the lifetime
namespace {
    // Helper function to safely create exception_ptr once
    std::exception_ptr get_not_connected_exception() {
        static std::exception_ptr ex = []() {
            try {
                throw std::runtime_error("Not connected");
            } catch (...) {
                return std::current_exception();
            }
        }();
        return ex;
    }
    
    std::exception_ptr get_send_failed_exception() {
        static std::exception_ptr ex = []() {
            try {
                throw std::runtime_error("Failed to send message");
            } catch (...) {
                return std::current_exception();
            }
        }();
        return ex;
    }
    
    std::exception_ptr get_unknown_error_exception() {
        static std::exception_ptr ex = []() {
            try {
                throw std::runtime_error("Unknown error in send");
            } catch (...) {
                return std::current_exception();
            }
        }();
        return ex;
    }
    
    std::exception_ptr get_client_creation_failed_exception() {
        static std::exception_ptr ex = []() {
            try {
                throw std::runtime_error("Failed to create websocket client");
            } catch (...) {
                return std::current_exception();
            }
        }();
        return ex;
    }
    
    std::exception_ptr get_client_start_failed_exception() {
        static std::exception_ptr ex = []() {
            try {
                throw std::runtime_error("WebSocket client start failed");
            } catch (...) {
                return std::current_exception();
            }
        }();
        return ex;
    }
    
    std::exception_ptr get_connection_timeout_exception() {
        static std::exception_ptr ex = []() {
            try {
                throw std::runtime_error("Connection timeout");
            } catch (...) {
                return std::current_exception();
            }
        }();
        return ex;
    }
    
    std::exception_ptr get_websocket_stopped_exception() {
        static std::exception_ptr ex = []() {
            try {
                throw std::runtime_error("WebSocket stopped");
            } catch (...) {
                return std::current_exception();
            }
        }();
        return ex;
    }
    
    std::exception_ptr get_websocket_disconnected_exception() {
        static std::exception_ptr ex = []() {
            try {
                throw std::runtime_error("WebSocket disconnected");
            } catch (...) {
                return std::current_exception();
            }
        }();
        return ex;
    }
}

// Configuration constants - OPTIMIZED FOR ESP32 MEMORY CONSTRAINTS
namespace {
    // Reduced from 4096 to 2048 - SignalR messages are typically small
    constexpr size_t WEBSOCKET_BUFFER_SIZE = 2048;
    // Increased to 8192 - ESP32 WebSocket library needs more stack during reconnection
    // This prevents stack overflow during SSL handshake and error handling
    constexpr size_t WEBSOCKET_TASK_STACK_SIZE = 8192;
#ifdef CONFIG_SIGNALR_CALLBACK_STACK_SIZE
    constexpr size_t CALLBACK_TASK_STACK_SIZE = CONFIG_SIGNALR_CALLBACK_STACK_SIZE;
#else
    // OPTIMIZED: Reduced from 6144 to 5120 (5KB) - sufficient for JSON parsing
    // Stack monitoring showed typical usage is ~3-4KB
    constexpr size_t CALLBACK_TASK_STACK_SIZE = 5120;
#endif
    constexpr UBaseType_t CALLBACK_TASK_PRIORITY = 5;
    // OPTIMIZED: Increased from 10s to 15s - reconnection often takes longer
    // especially when server is restarting or network is recovering
#ifdef CONFIG_SIGNALR_CONNECTION_TIMEOUT_MS
    constexpr uint32_t CONNECTION_TIMEOUT_MS = CONFIG_SIGNALR_CONNECTION_TIMEOUT_MS;
#else
    // SHORT timeout (5 seconds) - if we can't connect quickly, let the app retry later
    // This prevents blocking the main loop for too long during reconnection.
    // The main loop polls every second and will retry if needed.
    constexpr uint32_t CONNECTION_TIMEOUT_MS = 5000;
#endif
#ifdef CONFIG_SIGNALR_MAX_QUEUE_SIZE
    constexpr size_t MAX_MESSAGE_QUEUE_SIZE = CONFIG_SIGNALR_MAX_QUEUE_SIZE;
#else
    // Reduced from 50 to 20 - prevents excessive memory usage
    constexpr size_t MAX_MESSAGE_QUEUE_SIZE = 20;
#endif
    
    // Connection retry parameters
    constexpr uint32_t INITIAL_RETRY_DELAY_MS = 1000;
    constexpr uint32_t MAX_RETRY_DELAY_MS = 30000;
    constexpr float RETRY_BACKOFF_MULTIPLIER = 2.0f;
    
    // PSRAM usage threshold - buffers larger than this go to PSRAM if available
    constexpr size_t PSRAM_THRESHOLD = 1024;
}

namespace signalr {

esp32_websocket_client::esp32_websocket_client(const signalr_client_config& config)
    : m_client(nullptr)
    , m_event_group(nullptr)
    , m_callback_task(nullptr)
    , m_callback_semaphore(nullptr)
    , m_callback_task_running(false)
    , m_is_connected(false)
    , m_is_stopping(false) {
    
    m_event_group = xEventGroupCreate();
    if (!m_event_group) {
        ESP_LOGE(TAG, "Failed to create event group");
    }
    
    // Counting semaphore to avoid losing wakeups when many frames arrive quickly
    m_callback_semaphore = xSemaphoreCreateCounting(MAX_MESSAGE_QUEUE_SIZE, 0);
    if (!m_callback_semaphore) {
        ESP_LOGE(TAG, "Failed to create callback semaphore");
    }
}

esp32_websocket_client::~esp32_websocket_client() {
    stop_callback_processor();
    if (m_client) {
        stop([](std::exception_ptr) {});
    }
    if (m_event_group) {
        vEventGroupDelete(m_event_group);
    }
    if (m_callback_semaphore) {
        vSemaphoreDelete(m_callback_semaphore);
    }
}

void esp32_websocket_client::start(const std::string& url, std::function<void(std::exception_ptr)> callback) {
    ESP_LOGI(TAG, "Starting WebSocket connection to %s", url.c_str());
    
    if (m_client) {
        ESP_LOGW(TAG, "Client already exists, stopping first");
        stop([](std::exception_ptr) {});
    }

