maker-community/esp-signalr/src/adapters/esp32_websocket_client.cpp
    m_is_stopping = false;
    xEventGroupClearBits(m_event_group, CONNECTED_BIT | DISCONNECTED_BIT | MESSAGE_RECEIVED_BIT);
    
    // Clear any pending state
    {
        std::lock_guard<std::mutex> lock(m_queue_mutex);
        while (!m_message_queue.empty()) {
            m_message_queue.pop();
        }
    }
    {
        std::lock_guard<std::mutex> lock(m_callback_mutex);
        m_pending_receive_callback = nullptr;
    }

    esp_websocket_client_config_t ws_cfg = {};
    ws_cfg.uri = url.c_str();
    ws_cfg.buffer_size = WEBSOCKET_BUFFER_SIZE;
    ws_cfg.task_stack = WEBSOCKET_TASK_STACK_SIZE;
    // Set network timeout to prevent premature disconnection
    // This should be longer than the SignalR server_timeout to allow SignalR-level timeout handling
    ws_cfg.network_timeout_ms = 120000;  // 120 seconds (2x the SignalR server_timeout of 60s)
    // CRITICAL: Disable WebSocket-level auto-reconnect so SignalR layer can handle reconnection
    // If WebSocket auto-reconnects, SignalR's handle_disconnection() won't be called
    ws_cfg.disable_auto_reconnect = true;  // Completely disable auto-reconnect
    // Disable automatic ping to save bandwidth (SignalR has its own keepalive)
    ws_cfg.ping_interval_sec = 0;

    m_client = esp_websocket_client_init(&ws_cfg);
    if (!m_client) {
        ESP_LOGE(TAG, "Failed to create websocket client");
        callback(get_client_creation_failed_exception());
        return;
    }

    esp_websocket_register_events(m_client, WEBSOCKET_EVENT_ANY, 
                                  websocket_event_handler, this);

    esp_err_t err = esp_websocket_client_start(m_client);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "WebSocket client start failed: %s", esp_err_to_name(err));
        callback(get_client_start_failed_exception());
        esp_websocket_client_destroy(m_client);
        m_client = nullptr;
        return;
    }

    // Wait for connection with timeout
    EventBits_t bits = xEventGroupWaitBits(m_event_group,
                                          CONNECTED_BIT | DISCONNECTED_BIT,
                                          pdFALSE, pdFALSE,
                                          pdMS_TO_TICKS(CONNECTION_TIMEOUT_MS));

    if (bits & CONNECTED_BIT) {
        ESP_LOGI(TAG, "WebSocket connected successfully");
        start_callback_processor();
        callback(nullptr);
    } else {
        ESP_LOGE(TAG, "Connection timeout or failed");
        // CRITICAL: Clean up the WebSocket client on timeout!
        // Otherwise the client keeps running and may connect later, causing state inconsistency.
        if (m_client) {
            ESP_LOGI(TAG, "Cleaning up WebSocket client after timeout...");
            esp_websocket_client_stop(m_client);
            esp_websocket_client_destroy(m_client);
            m_client = nullptr;
        }
        callback(get_connection_timeout_exception());
    }
}

void esp32_websocket_client::stop(std::function<void(std::exception_ptr)> callback) {
    ESP_LOGI(TAG, "Stopping websocket");
    m_is_stopping = true;
    
    // Stop callback processor first
    stop_callback_processor();
    
    // Notify any pending receive callback about disconnection
    // Use consistent lock order: queue_mutex -> callback_mutex
    std::function<void(const std::string&, std::exception_ptr)> pending_cb;
    {
        std::lock_guard<std::mutex> queue_lock(m_queue_mutex);
        std::lock_guard<std::mutex> cb_lock(m_callback_mutex);
        if (m_pending_receive_callback) {
            pending_cb = m_pending_receive_callback;
            m_pending_receive_callback = nullptr;
        }
    }
    if (pending_cb) {
        // Signal message received to unblock any waiting task
        xEventGroupSetBits(m_event_group, MESSAGE_RECEIVED_BIT);
        pending_cb("", get_websocket_stopped_exception());
    }
    
    if (m_client) {
        // Use a timeout for close to prevent hanging indefinitely if the connection is already broken
        // The transport layer might be stuck waiting for a Close frame that will never come
        ESP_LOGI(TAG, "Closing WebSocket client...");
        esp_websocket_client_close(m_client, pdMS_TO_TICKS(1000)); 
        
        ESP_LOGI(TAG, "Stopping WebSocket client...");
        esp_websocket_client_stop(m_client);
        
        ESP_LOGI(TAG, "Destroying WebSocket client...");
        esp_websocket_client_destroy(m_client);
        m_client = nullptr;
    }
    m_is_connected = false;
    xEventGroupClearBits(m_event_group, CONNECTED_BIT);
    ESP_LOGI(TAG, "WebSocket client cleanup complete");
    callback(nullptr);
}

void esp32_websocket_client::send(const std::string& payload, transfer_format transfer_format,
                                  std::function<void(std::exception_ptr)> callback) {
    // OPTIMIZED: Use pre-created exceptions to avoid throw-catch overhead
    // No exceptions are thrown at runtime - zero stack unwinding cost!
    
    // Quick path: check connection status without any exception overhead
    if (!m_client || !m_is_connected) {
        ESP_LOGW(TAG, "Cannot send: not connected (payload size: %d bytes)", payload.size());
        // Use pre-created exception - no throw/catch, no stack overhead!
        callback(get_not_connected_exception());
        return;
    }

    // Try to send - wrapped in try-catch only for ESP-IDF API safety
    try {
        int sent = esp_websocket_client_send_text(m_client, payload.c_str(), 
                                                  payload.length(), portMAX_DELAY);
        if (sent < 0) {
            ESP_LOGE(TAG, "Failed to send message (returned: %d)", sent);
            // Use pre-created exception - no throw/catch!
            callback(get_send_failed_exception());
        } else {
            ESP_LOGD(TAG, "Sent %d bytes", sent);
            callback(nullptr);
        }
    }
    catch (const std::exception& e) {
        // This should rarely happen - only if ESP-IDF API throws
        ESP_LOGE(TAG, "Unexpected exception in send(): %s", e.what());
        try {
            callback(std::current_exception());
        } catch (...) {
            // If callback throws, use pre-created exception
            ESP_LOGE(TAG, "CRITICAL: Callback threw exception, using fallback error");
            callback(get_unknown_error_exception());
        }
    }
    catch (...) {
        // Catch-all safety net
        ESP_LOGE(TAG, "Unknown exception in send()");
        callback(get_unknown_error_exception());
    }
}

/**
 * receive() - Called by websocket_transport::receive_loop()
 * 
 * This method bridges ESP32's event-driven WebSocket model to SignalR's
 * callback-per-message model. The SignalR transport calls receive() and
 * expects the callback to be invoked with exactly ONE message, then it
 * calls receive() again for the next message (recursive loop).
 * 
 * Implementation:
 * Always save the callback and let the callback processor handle delivery.
 * This avoids deep recursion when receive() is called from within a callback.
 * 
 * Lock ordering: queue_mutex -> callback_mutex (must be consistent everywhere)
 */
void esp32_websocket_client::receive(std::function<void(const std::string&, std::exception_ptr)> callback) {
    ESP_LOGD(TAG, "receive() called");
    
    bool has_message = false;
    {
        std::lock_guard<std::mutex> queue_lock(m_queue_mutex);
        has_message = !m_message_queue.empty();
        
        // Always save callback - callback processor will handle delivery
        std::lock_guard<std::mutex> lock(m_callback_mutex);
        m_pending_receive_callback = callback;
    }
    
