maker-community/esp-signalr/src/adapters/esp32_websocket_client.cpp
    if (has_message) {
        schedule_callback_delivery();
    }
}

/**
 * try_deliver_message() - Called when a new message is added to the queue
 * 
 * OPTIMIZED: Reduced task creation overhead by using a simpler callback structure.
 * The callback_payload now uses move semantics to avoid string copies.
 * 
 * IMPORTANT: We acquire locks in the same order as receive() to avoid deadlock:
 * 1. queue_mutex first
 * 2. callback_mutex second
 */
void esp32_websocket_client::try_deliver_message() {
    std::function<void(const std::string&, std::exception_ptr)> callback;
    std::string message;
    
    {
        // Acquire locks in same order as receive() to prevent deadlock
        std::lock_guard<std::mutex> queue_lock(m_queue_mutex);
        std::lock_guard<std::mutex> cb_lock(m_callback_mutex);
        
        if (!m_pending_receive_callback) {
            ESP_LOGW(TAG, "try_deliver_message: No pending callback, queue size: %d", m_message_queue.size());
            return; // No pending callback, message stays in queue
        }
        
        if (m_message_queue.empty()) {
            ESP_LOGW(TAG, "try_deliver_message: Queue is empty but callback is pending");
            return; // No message to deliver
        }
        
        message = std::move(m_message_queue.front());  // Use move to avoid copy
        m_message_queue.pop();
        callback = std::move(m_pending_receive_callback);  // OPTIMIZED: Move callback too
        m_pending_receive_callback = nullptr;
        ESP_LOGD(TAG, "Deliver: %d bytes, queue: %zu", message.length(), m_message_queue.size());
    }
    
    // SIMPLIFIED: Execute callback inline instead of creating a new task for each message
    // This saves ~6KB stack per callback and avoids task creation failures under memory pressure
    // The callback_processor_task already provides sufficient stack for callback execution
    try
    {
        callback(message, nullptr);
        ESP_LOGD(TAG, "Callback executed inline successfully");
    }
    catch (const std::exception& e)
    {
        ESP_LOGE(TAG, "Callback exception: %s", e.what());
    }
    catch (...)
    {
        ESP_LOGE(TAG, "Callback unknown exception");
    }
}

// WebSocket event handler
void esp32_websocket_client::websocket_event_handler(void* handler_args, esp_event_base_t base, int32_t event_id, void* event_data) {
    auto* client = static_cast<esp32_websocket_client*>(handler_args);
    esp_websocket_event_data_t* data = static_cast<esp_websocket_event_data_t*>(event_data);

    switch (event_id) {
        case WEBSOCKET_EVENT_CONNECTED:
            ESP_LOGI(TAG, "WebSocket connected");
            client->handle_connected();
            break;

        case WEBSOCKET_EVENT_DISCONNECTED:
            ESP_LOGI(TAG, "WebSocket disconnected");
            client->handle_disconnected();
            break;

        case WEBSOCKET_EVENT_DATA:
            if (data->op_code == 0x01) {  // Text frame
                client->handle_data(data->data_ptr, data->data_len);
            } else if (data->op_code == 0x0A) {  // Pong frame
                ESP_LOGD(TAG, "Received pong");
            }
            break;

        case WEBSOCKET_EVENT_ERROR:
            ESP_LOGE(TAG, "WebSocket error");
            client->handle_error("WebSocket error occurred");
            break;

        default:
            break;
    }
}

void esp32_websocket_client::handle_connected() {
    m_is_connected = true;
    xEventGroupSetBits(m_event_group, CONNECTED_BIT);
}

void esp32_websocket_client::handle_disconnected() {
    m_is_connected = false;
    xEventGroupSetBits(m_event_group, DISCONNECTED_BIT);
    xEventGroupClearBits(m_event_group, CONNECTED_BIT);
    
    // Notify pending receive callback about disconnection
    // Use consistent lock order: queue_mutex -> callback_mutex
    if (!m_is_stopping) {
        std::function<void(const std::string&, std::exception_ptr)> cb;
        {
            std::lock_guard<std::mutex> queue_lock(m_queue_mutex);
            std::lock_guard<std::mutex> cb_lock(m_callback_mutex);
            if (m_pending_receive_callback) {
                cb = m_pending_receive_callback;
                m_pending_receive_callback = nullptr;
            }
        }
        if (cb) {
            cb("", get_websocket_disconnected_exception());
        }
    }
}

void esp32_websocket_client::handle_data(const char* data, int data_len) {
    if (!data || data_len <= 0) {
        return;
    }

    // OPTIMIZED: Use PSRAM for receive buffer if available
    // This reduces internal RAM pressure significantly
    if (m_receive_buffer.capacity() < m_receive_buffer.size() + data_len) {
        size_t new_capacity = m_receive_buffer.size() + data_len + 512;
        // Try to use PSRAM for larger buffers
        if (new_capacity >= PSRAM_THRESHOLD && signalr::memory::is_psram_available()) {
            // Reserve will handle the reallocation
            m_receive_buffer.reserve(new_capacity);
            ESP_LOGD(TAG, "Receive buffer expanded to %u bytes (PSRAM preferred)", 
                     (unsigned)m_receive_buffer.capacity());
        } else {
            m_receive_buffer.reserve(new_capacity);
        }
    }
    m_receive_buffer.append(data, data_len);
    
    // Check for SignalR record separator (0x1E)
    size_t separator_pos = m_receive_buffer.find('\x1e');
    while (separator_pos != std::string::npos) {
        // OPTIMIZED: Use move semantics to avoid copy
        std::string message;
        message.reserve(separator_pos);
        message.assign(m_receive_buffer, 0, separator_pos);
        m_receive_buffer.erase(0, separator_pos + 1);
        
        // Reduced logging: Only log message length, not content (saves memory)
        ESP_LOGD(TAG, "RX msg: %d bytes", message.length());
        
        // Add message to queue (with overflow protection)
        {
            std::lock_guard<std::mutex> lock(m_queue_mutex);
            if (m_message_queue.size() < MAX_MESSAGE_QUEUE_SIZE) {
                m_message_queue.push(std::move(message));
                ESP_LOGD(TAG, "Queue size: %zu", m_message_queue.size());
            } else {
                ESP_LOGW(TAG, "Queue full, drop oldest");
                m_message_queue.pop();
                m_message_queue.push(std::move(message));
            }
        }
        
        // Signal callback processor task to deliver message
        schedule_callback_delivery();
        
