maker-community/esp-signalr/src/adapters/esp32_websocket_client.cpp
        separator_pos = m_receive_buffer.find('\x1e');
    }
    
    // OPTIMIZED: More aggressive shrinking to free PSRAM/RAM
    if (m_receive_buffer.capacity() > 4096 && m_receive_buffer.size() < 512) {
        m_receive_buffer.shrink_to_fit();
        ESP_LOGD(TAG, "Shrunk receive buffer to save memory");
    }
}

void esp32_websocket_client::handle_error(const char* error_msg) {
    if (error_msg && !m_is_stopping) {
        // Use consistent lock order: queue_mutex -> callback_mutex
        std::function<void(const std::string&, std::exception_ptr)> cb;
        {
            std::lock_guard<std::mutex> queue_lock(m_queue_mutex);
            std::lock_guard<std::mutex> cb_lock(m_callback_mutex);
            if (m_pending_receive_callback) {
                cb = m_pending_receive_callback;
                m_pending_receive_callback = nullptr;
            }
        }
        if (cb) {
            // For dynamic error messages, we must use make_exception_ptr
            // This is rare (only on actual errors), so the overhead is acceptable
            try {
                cb("", std::make_exception_ptr(std::runtime_error(error_msg)));
            } catch (...) {
                // Fallback: use pre-created generic exception
                ESP_LOGE(TAG, "Exception during error callback, using fallback");
                try {
                    cb("", get_unknown_error_exception());
                } catch (...) {
                    ESP_LOGE(TAG, "Failed to deliver error callback");
                }
            }
        }
    }
}

// ============================================================================
// Callback Processor Task
// ============================================================================
// SignalR callbacks involve heavy processing (JSON parsing, state management)
// and can trigger recursive calls. Running them directly on the WebSocket
// event handler thread causes stack overflow. This task provides a dedicated
// thread with sufficient stack for callback execution.

void esp32_websocket_client::callback_processor_task(void* param) {
    auto* client = static_cast<esp32_websocket_client*>(param);
    ESP_LOGI(TAG, "Callback processor task started");
    
    // Always monitor stack to detect issues early
    UBaseType_t high_water_mark_start = uxTaskGetStackHighWaterMark(NULL);
    ESP_LOGI(TAG, "Callback task stack: ~%u bytes free initially", 
             high_water_mark_start * sizeof(StackType_t));
    
    // Log initial heap state
    signalr::memory::log_memory_stats("callback_task_start");
    
    ESP_LOGI(TAG, "Callback processor: entering main loop");
    while (client->m_callback_task_running) {
        // Wait for signal that a message is ready
        if (xSemaphoreTake(client->m_callback_semaphore, pdMS_TO_TICKS(100)) == pdTRUE) {
            ESP_LOGD(TAG, "Callback processor: got semaphore, processing messages");
            
            // Keep processing while there are messages OR a pending callback
            // The loop continues as long as there's work to potentially do
            int message_count = 0;
            int idle_rounds = 0;
            const int MAX_IDLE_ROUNDS = 200; // 200 * 10ms = 2000ms max idle (increased from 500ms)
            
            while (client->m_callback_task_running && idle_rounds < MAX_IDLE_ROUNDS) {
                // OPTIMIZED: Reduced stack monitoring frequency to every 20 messages
                if (message_count > 0 && message_count % 20 == 0) {
                    UBaseType_t stack_free = uxTaskGetStackHighWaterMark(NULL);
                    ESP_LOGD(TAG, "Stack: %u bytes free", stack_free * sizeof(StackType_t));
                    if (stack_free * sizeof(StackType_t) < 512) {
                        ESP_LOGW(TAG, "WARNING: Low stack!");
                    }
                }
                
                bool has_messages = false;
                bool has_callback = false;
                
                // Check state
                {
                    std::lock_guard<std::mutex> lock(client->m_queue_mutex);
                    has_messages = !client->m_message_queue.empty();
                }
                {
                    std::lock_guard<std::mutex> cb_lock(client->m_callback_mutex);
                    has_callback = client->m_pending_receive_callback != nullptr;
                }
                
                // If we have both message and callback, deliver
                if (has_messages && has_callback) {
                    message_count++;
                    ESP_LOGD(TAG, "Processing message #%d", message_count);
                    client->try_deliver_message();
                    idle_rounds = 0; // Reset idle counter on successful delivery
                    
                    // Give SignalR time to process and call receive() again
                    vTaskDelay(pdMS_TO_TICKS(5));
                } else if (has_messages && !has_callback) {
                    // Messages waiting but no callback yet - wait for receive() to be called
                    idle_rounds++;
                    vTaskDelay(pdMS_TO_TICKS(10));
                } else {
                    // No messages - exit the loop
                    break;
                }
            }
            
            if (idle_rounds >= MAX_IDLE_ROUNDS) {
                ESP_LOGW(TAG, "Callback timeout, %d messages queued", 
                         (int)client->m_message_queue.size());
            } else if (message_count > 0) {
                ESP_LOGI(TAG, "Processed %d messages", message_count);
            }
        }
    }
    
    // Always log final stack statistics
    UBaseType_t high_water_mark_end = uxTaskGetStackHighWaterMark(NULL);
    ESP_LOGI(TAG, "Callback task final: %u bytes stack free (min)",
             high_water_mark_end * sizeof(StackType_t));
    signalr::memory::log_memory_stats("callback_task_end");
    
    if (high_water_mark_end * sizeof(StackType_t) < 512) {
        ESP_LOGE(TAG, "CRITICAL: Task finished with very low stack!");
    }
    
    ESP_LOGI(TAG, "Callback processor task exiting");
    vTaskDelete(NULL);
}

void esp32_websocket_client::start_callback_processor() {
    if (m_callback_task != nullptr) {
        return; // Already running
    }
    
    m_callback_task_running = true;
    
    // Use larger stack for callback processor since it may execute callbacks inline
    // when task creation fails due to low memory
    uint32_t stack_size = signalr::memory::get_recommended_stack_size("callback");
    // Add extra 2KB for inline callback execution safety margin
    stack_size += 2048;
    
    BaseType_t result = xTaskCreate(
        callback_processor_task,
        "signalr_cb",
        stack_size,
        this,
        CALLBACK_TASK_PRIORITY,
        &m_callback_task
    );
    
    if (result != pdPASS) {
        ESP_LOGE(TAG, "Failed to create callback processor task (stack=%u)", stack_size);
        m_callback_task = nullptr;
        m_callback_task_running = false;
    } else {
        ESP_LOGI(TAG, "Callback processor created (stack=%u)", stack_size);
    }
}

void esp32_websocket_client::stop_callback_processor() {
    if (m_callback_task == nullptr) {
        return;
    }
    
    ESP_LOGI(TAG, "Stopping callback processor task");
    m_callback_task_running = false;
    
    // Signal the task to wake up and exit
    xSemaphoreGive(m_callback_semaphore);
    
    // Wait for task to exit (with timeout)
    for (int i = 0; i < 50 && m_callback_task != nullptr; i++) {
        vTaskDelay(pdMS_TO_TICKS(20));
    }
    
    m_callback_task = nullptr;
}

void esp32_websocket_client::schedule_callback_delivery() {
    ESP_LOGD(TAG, "schedule_callback_delivery called");
    if (m_callback_semaphore != nullptr) {
        BaseType_t result = xSemaphoreGive(m_callback_semaphore);
        if (result == pdTRUE) {
            ESP_LOGD(TAG, "schedule_callback_delivery: Semaphore given successfully");
        } else {
            ESP_LOGW(TAG, "schedule_callback_delivery: Failed to give semaphore (already given?)");
        }
    } else {
        ESP_LOGE(TAG, "schedule_callback_delivery: m_callback_semaphore is NULL!");
    }
}

} // namespace signalr
